<a href="https://colab.research.google.com/github/tarun1208/BasicML/blob/main/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

Q1. Create a Pandas DataFrame from the following dictionary:

data = {

'Name': ['Alice', 'Bob', 'Carol'],

'Age': [24, 27, 22],

'Salary': [50000, 55000, 48000]

}

• Add a new column called Bonus which is 10% of the salary.

In [4]:
data = {

'Name': ['Alice', 'Bob', 'Carol'],

'Age': [24, 27, 22],

'Salary': [50000, 55000, 48000]

}

a=pd.DataFrame(data)
a['Bonus']=a['Salary']*0.1
print(a)

    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0

Q2. Given the DataFrame created in the above question:

• Display the first two rows.

• Compute the mean salary.

In [9]:
# Display the first two rows.
df=a.iloc[:2,:]
print(df)

print('--------------------------------------')

#Compute the mean salary
df1=a['Salary'].mean()
print(df1)

    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
--------------------------------------
51000.0

Q3. Using the same DataFrame:

• Extract all rows where the Age is greater than 25.

• Filter out rows where the Salary is less than 50000.

In [11]:
# Extract all rows where the Age is greater than 25.
b=a[a['Age']>25]
print(b)

print('--------------------------------------')

#Filter out rows where the Salary is less than 50000.
c=a[a['Salary']<50000]
print(c)

  Name  Age  Salary   Bonus
1  Bob   27   55000  5500.0
--------------------------------------
    Name  Age  Salary   Bonus
2  Carol   22   48000  4800.0

Q4. Create the following DataFrame:

data = {

'A': [1, 2, None, 4],

'B': [None, 2, 3, None],

'C': [1, 2, 3, 4]

}

df = pd.DataFrame(data)

• Fill missing values in column A with the mean of the column.

• Drop rows where all values are None.

In [16]:
data = {
    'A': [1, 2, None, 4],
    'B': [None, 2, 3, None],
    'C': [1, 2, 3, 4]
}

df=pd.DataFrame(data)
print(df)

print('--------------------------------------')

 #Fill missing values in column A with the mean of the column.
b=df['A'].mean()
print(b)
df['A'].fillna(b,inplace=True)
print(df)

print('--------------------------------------')

#Drop rows where all values are None.
df.dropna(how='all',inplace=True)
print(df)

     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4
--------------------------------------
2.3333333333333335
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4
--------------------------------------
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

<ipython-input-16-563f5347f2b9>:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(b,inplace=True)

5. Create a DataFrame for employees:

data = {

'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],

'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],

'Salary': [50000, 45000, 60000, 65000, 70000]

}

• Group the data by Department and compute the total and mean salary for each
department.

In [20]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Salary': [50000, 45000, 60000, 65000, 70000]
}

a=pd.DataFrame(data)

b=a.groupby('Department')
print(b['Salary'].sum())

print('--------------------------------------')

print(b['Salary'].mean())

Department
Finance     70000
HR          95000
IT         125000
Name: Salary, dtype: int64
--------------------------------------
Department
Finance    70000.0
HR         47500.0
IT         62500.0
Name: Salary, dtype: float64

6. Given two DataFrames:

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})

df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})

• Perform an inner join on the ID column.

In [21]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})

df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})

a=pd.merge(df1,df2,on='ID',how='inner')
print(a)

   ID   Name  Age
0   2    Bob   25
1   3  Carol   30

Q7. Given a small dataset, clean and display basic statistics using Pandas.